// Напишите программу, которая будет принимать на вход два числа и выводить, 
// является ли второе число кратным первому. Если число 2 не кратно числу 1, 
// то программа выводит остаток от деления.

// 34, 5 -> не кратно, остаток 4
// 16, 4 -> кратно

Console.Write("Введите первое число ");
int N1 = int.Parse(Console.ReadLine());
Console.Write("Введите второе число ");
int N2 = int.Parse(Console.ReadLine());
// int ost;
if (N1%N2 == 0)
{
    Console.Write("Число N1 кратно числу N2");
}
else
{
    int ost = N1 % N2;
    Console.Write("Остаток отделения равен " + ost);
}