// Напишите программу, которая по заданному номеру четверти, показывает диапазон 
// возможных координат точек в этой четверти (x и y).Console.Write("Введите координату X:  ");
Console.Write("Введите номер четверти (I-IV):  ");
int n = int.Parse(Console.ReadLine()!);


if (n == 1) Console.WriteLine("Диапозон возможных координат => 0++...∞");
if (n == 2) Console.WriteLine("Диапозон возможных координат => X => 0++...-∞, Y=> 0++...+∞");
if (n == 3) Console.WriteLine("Диапозон возможных координат => X => 0++...-∞, Y=> 0++...-∞");
if (n == 4) Console.WriteLine("Диапозон возможных координат => X => 0++...+∞, Y=> 0++...-∞");